/**
 * Ответы на вопросы
 * 1 сложность O(n) - нужно пройтись по всем эллементам массива
 * 
 * 2 сложность O(n^2) - вложенный цикл
 * 
 * 3 я бы использовал Set() ))) ну а вообще, я бы собрал бы хеш например {} ключи эллементы, значения количиство вхождений
 * 
 * 4 потому, что сложность O(n log) чем больше данных тем он эффективнее, количество шагов растет логорифмически
 * 
 * A O(n); B O(n^2); C O(n)
 */

// #### Задание 2: Оптимизация
// Дана функция с `O(n²)` сложностью. Оптимизируй её до `O(n)` с использованием хэш-таблицы:


function hasPairWithSum(arr: number[], target: number): boolean {
  for (let i = 0; i < arr.length; i++) {
    for (let j = i + 1; j < arr.length; j++) {
      if (arr[i] + arr[j] === target) return true;
    }
  }
  return false;
}

